{
  "ЭТО часть физического диска, которая после форматирования может использоваться файловой системой как отдельное устройство (за одним исключением).": "раздел",
  "Эта подпрограмма (процедура) в ПК определяет объём установленной оперативной памяти, её исправность, подключённые периферийные устройства и конфигурацию системы.": "POST",
  "Сколько выделяют основных структур ОС? (число)": "5",
  "Как называется минимальный адресуемый элемент пространства жесткого диска?": "сектор",
  "Именно так называют базовый набор программ, обеспечивающих взаимодействие с аппаратными компонентами, обслуживая низкоуровневые программируемые элементы платформы, и предоставляющих среду выполнения приложениям, работающим на компьютере.": "операционная система",
  "В рамках какой системы структура хранения данных на диске не предполагает количество разделов свыше четырех?": "MBR",
  "Сколько выделяют типов ядер ОС? (число)": "3",
  "Он является просто структурой данных с полем счетчика, поддерживающей три операции: инициализацию с неотрицательным значением, уменьшение и увеличение на единицу.": "семафор",
  "Многозадачная ОС должна обеспечивать соответствующий механизм общения процессов друг с другом, для которого общепринят термин...": "IPC",
  "Выберите ОС с кооперативной многозадачностью:": ["MacOS", "Windows 1.0", "Windows 3.11"],
  "Понятие \"кластер\" используется в:": ["fat", "ntfs"],
  "Для успешной загрузки ОС требуется некоторый «промежуточный слой» между программной и аппаратной частями. Как этот слой называют?": "BIOS",
  "Такие ОС предназначены для поддержки работы только одного пользователя в каждый конкретный момент времени. Несколько пользователей не могут одновременно разделять ресурсы вычислительной системы.": "однопользовательские",
  "Такие ОС позволяют одновременно нескольким процессам разделять ресурсы вычислительной системы.": "многозадачные",
  "ЭТО некая абстракция современных ОС, выполняющая строго одну из последовательностей инструкций в адресном пространстве, представляющем собой множество адресов памяти, к которым разрешен доступ.": "поток",
  "В этом режиме работы процессора функционирует ВІОЅ:": "реальный режим",
  "Возможность современной операционной системой Windows или Linux использовать драйвера специфического оборудования компьютера возможно для такой firmware:": "UEFI",
  "Это простейший двоичный семафор, который может находиться в одном из двух состояний — отмеченном или неотмеченном (открыт и закрыт соответственно).": "мьютекс",
  "В рамках какой системы структура хранения данных на диске не предполагает разделы свыше 2 Тб?": "MBR",
  "В данной ОС имеется помимо прочих файл /dev/sda7. Вопрос: какое количество логических дисков имеется на данном компьютере?": "3",
  "Возможность современной операционной системой Windows или Linux использовать драйвера специфического оборудования компьютера невозможно для такой firmware:": "BIOS",
  "ЭТО некая фундаментальная абстракция, выполняющая одну или несколько последовательностей инструкций в адресном пространстве, представляющем собой множество адресов памяти, к которым разрешен доступ.": "процесс",
  "В данной ОС имеется помимо прочих файл /dev/hda8. Вопрос: какое количество логических дисков имеется на данном компьютере?": "4",
  "При такой многозадачности ОС сама передает управление от одной задачи к другой": "вытесняющая",
  "В данной ОС имеется помимо прочих файл /dev/sda7 и /dev/sdb5. Вопрос: какое количество логических дисков имеется на данном компьютере?": "4",
  "Организация мультизадачного режима, опирается на следующее аппаратное и программное средство для механизма переключения задач.": "TSS",
  "Какой режим работы процессора используется при задействовании 64х разрядной операционной системы?": "long mode",
  "Какой режим работы процессора используется при задействовании 32х разрядной операционной системы защищенного режима?": "legacy mode",
  "Для такой системы хранения все разделы одинаковые.": "GPT",
  "Раздел этой ФС делится на две части: зону Master File Table и пользовательские данные.": "NTFS",
  "Режимы <<Журналирование» (Journaled), «Упорядоченный» (Ordered) и «Запись на диск» (Writeback) это режимы в ФС ...": "ext3",
  "Эта файловая система поддерживает только четыре файловых атрибута: системный, скрытый, только чтение, архивный.": "FAT",
  "Обособленная последовательность секторов называется:": "раздел",
  "Журнал в этой ФС подразумевает использование соответствующей службой ОС файла $LogFile": "NTFS",
  "В этой ФС любой файл это именованный набор потоков с различными данными.": "NTFS",
  "ЭТО для текущей (активной) задачи должно быть загружено в регистр задачи (TR).": "селектор TSS",
  "В ФС ext2 входит: Загрузочная область, Информационный узел, Суперблок и ...": "блоки и группы блоков",
  "Какая структура создается для любого процесса в защищенном режиме?": "сегмент состояния задачи",
  "В современных х86-64 процессорах есть режим long mode и такой": "legacy mode",
  "Это одно из ключевых нововведений, позволяющее работать с блоками памяти, в ФС ext4.": "экстент",
  "Для такой системы хранения разделы делятся на основные и дополнительные.": "MBR",
  "В ФС ext2 входит: Блоки и группы блоков, Информационный узел, Суперблок и ...": "загрузочная область",
  "Минимальное адресуемое пространство диска называется:": "сектор",
  "Какие ФС являются журналируемыми?": ["NTFS", "ext3"],
  "Где может быть записан файл в NTFS, если его размер очень мал?": "MFT"
}
