{
  "Допустимо ли вложение элементов разметки друг в друга?": "да, допустимо",
  "Концепция, позволяющая нескольким логическим веб-серверам располагаться на одном физическом сервере даже с одним ІР адресом, называется ...": "виртуальный хост",
  "Файл .htaccess является частью:": "он не относится ни к одному",
  "Поскольку установка и разрыв ТСР/ІР соединений для каждого ресурса является тратой времени и пропускной способности канала на служебный трафик, для предотвращения этого в рамках протокола НТТР используется значение заголовка, содержащего такой параметр с целью передать необходимость сохранения соединения на определенное время при бездействии клиента.": "keep-alive",
  "Укажите одиночный тег:": "<br>",
  "Какими символами в html обозначаются теги?": "<и>",
  "Программа, запущенная на компьютере пользователя и соединенная по сети с НТТР-сервером, называется ... (одно слово)": "браузер",
  "Каждый ответ сервера, разделенный на 5 различных категорий, всегда содержит строку статуса, где есть код ответа, который является числом. Сколько цифр в коде? (число)": "3",
  "Каким средством обеспечивается централизованное управление стилями страниц web-ресурса?": "CSS",
  "Хост, выступающий как передающий агент для запроса к http-серверу, называется ...": "прокси-сервер",
  "Разработчики сети ARPANET заложили в основу её функционирования следующие важнейшие принципы:": ["гибкая маршрутизация при организации связи между отправителем и получателем информации", "технологии коммутации пакетом и технологии разделения передаваемой информации на отдельные части или пакеты", "равноправность компьютеров сети", "сокрытие от пользователей механизмов работы сети"],
  "Какие http-запросы используются для передачи информации от клиента на сервер через URL?": "GET",
  "что из представленного не Web-сервер?": "MVC",
  "Иерархическое пространство доменных имен, организованное для целей связи понятных пользователю имен ресурсов с ІР-адресами серверов, называется ...": "DNS",
  "Этот компонент, в рамках стека протоколов TCP/IP, позволяет различать работающие процессы на компьютере при определении адресата во время передачи данных.": "порт",
  "В языке html5 введено:": "элементы форм не только для ввода, но и для вывода информации",
  "В документе HTML существует контейнер HEAD и контейнер BODY. Укажите верное утверждение относительно оациональности или обязательности их.": "head и body опциональны",
  "что такое apache?": "web-сервер",
  "Какие http-запросы используются для передачи информации полей html-формы от клиента на сервер?": "POST",
  "Основной протокол передачи, используемый в Интернет, называется ...": "HTTP",
  "Каждый ответ сервера всегда содержит строку статуса, имеющей код ответа в виде трехзначного числа. Первая цифра кода ответа является идентификатором категории ответа. Какая первая цифра будет при кодах ответа характеризующих успешные ответы?": "2",
  "W3WP является частью:": "IIS",
  "Этот способ хранения данных о состоянии, созданный компанией Netscape в 1995 году, даёт серверу возможность хранить информацию о сессии на стороне клиента": "cookie",
  "Верно, что GET запрос не предполагает тело HTTP-запроса, а только заголовок?": "Верно",
  "Это является набором данных, который подтверждает подлинность. Это создается и проверяется на подлинность подтвержденной третьей стороной, известной как центр этого.": "сертификат",
  "С целью обеспечения безопасной передачи данных от браузера клиента до Web-сервера, необходимо использовать протокол ...": "HTTPS",
  "С помощью этого расширения в РНР имеется возможность подключаться к любой БД поддерживающей открытый стандарт соединения.": "ODBC",
  "Так как РНР реализован на базе виртуальной машины, исходный код преобразуется в понятные ей инструкции, называемые так:": "opcode",
  "Укажите верный пример:": "#!/usr/bin/perl\nsay \"Hello, world!\";",
  "В рамках паттерна МVС у каждого компонента есть свой функционал, укажите, какой имеется у модели?": "содержит данные предметной области",
  "В чем ключевая причина создания .NET Core?": "кроссплатформенность",
  "Первый фреймворк для веб-разработки от компании Microsoft, созданный на базе основных библиотек платформы ASP.NET:": "WebForms",
  "В РНР имеется возможность делать комментарии кода следующими способами:": "// comment",
  "Как называется технология от компании Microsoft, которая принесла в веб-приложения шаблонизацию?": "ASP",
  "В 8-й версии данного языка программирования был введен механизм JIT-компиляции.": "PHP",
  "В языке РНР этот спецсимвол используется для указания переменной в различных выражениях.": "$",
  "язык РНР является:": "интерпретируемым объектно-ориентированным",
  "Что такое МVС?": "концепция разделения приложения на три компонента",
  "В рамках данной технологии мы можем создавать CMS на языке программирования C#.": "ASP.NET",
  "Язык Perl является:": "интерпретируемым объектно-ориентированным",
  "Новая платформа, которую Microsoft выпустила 2007 году, отражала формирующиеся тенденции в разработке веб-приложений и получила название:": "ASP.NET MVC Framework",
  "Для выполнения внешней команды в программе Perl следует использовать запись, обрамленную в эти спецсимволы (введите сами символы):": "``",
  "РНР использует это расширение для реализации подключения к БД MySQL.": "mysqli",
  "Исходный код полностью открыт для ...": "все указанные",
  "В каком языке программирования есть функция pg_query()?": "PHP",
  "Этот язык программирования был создан изначально для работы с большими объемами текстовой информации, но в последующем, в том числе из-за обширного инструментария по работе с текстами, был очень хорошо принят в качестве одного из основных при разработке систем управления контентом.": "Perl",
  "РНР использует sqlsrv_connect и sqlsrv_query для реализации подключения к такой СУБД:": "MS SQL",
  "Скрипты, написанные на данном языке программирования, выполняются на сервере и генерируют HTML-документ перед отправкой клиенту посредством специального интерпретатора, как правило являющегося модулем НТТР-сервера.": "PHP",
  "какое средство, технология или язык относится к Rich Internet Application?": "JavaScript",
  "Подобие трехмерности пространства страницы html-документа можно реализовать в:": "<div>",
  "Эта команда СЅЅ позволяет импортировать таблицу стилей из внешнего файла.": "@import",
  "Вариант точки отсчета при позиционировании слоя задается этим свойством:": "position",
  "Идентификаторы стиля задаются названием, начинающимся с этого символа:": "#",
  "Игнорировать перекрывающие правила CSS можно благодаря этой команде-модификатору:": "!important",
  "Классы стиля задаются названием, начинающимся с этого символа:": ".",
  "Этот тег позволяет импортировать таблицу стилей CSS из внешнего файла.": "link",
  "Элемент, к которому применяются правила СЅЅ, определяется этим. Как называется \"Это\"?": "селектор",
  "Этот контейнер следует использовать при \"верстке таблицами\"": "table",
  "CSS это:": "Cascading Style Sheets",
  "Ничего не передающий элемент группировки (если специально не задано) и контейнер это:": "div",
  "Выберите из списка инструменты, средства или технологии, используемые для front-end разработки": "HTML5 API",
  "Как называется элемент каскадной таблицы стилей, реализующий способ применения правил СЅЅ для всех элементов?": "универсальный селектор",
  "Это предполагает возможность задавать один набор правил к нескольким элементам.": "групповая селекция",
  "Классы стиля задаются этим параметром внутри целевого тега:": "class",
  "Идентификаторы стиля задаются этим параметром внутри целевого тега:": "id",
  "Эта библиотека, написанная на JavaScript и представленная Джоном Резигом в начале 2006 года, имеющая обширный функционал, что уже более походит на фреймворк, называется:": "jQuery",
  "Как правило jQuery используется как инструмент для:": "front-end",
  "Boot, Data, Cloud, Cloud Data Flow, Security, Bсë это названия компонентов фреймворка:": "Spring",
  "Он поддерживает несколько языков JVM: Java, Kotlin и Groovy.": "Spring",
  "React.js позволяет создавать сложные пользовательские интерфейсы из небольших и изолированных частей кода, называемых этим термином, который относится к основополагающей концепции React.js, когда говорят \"многоразовые ...\". Что это?": "компоненты",
  "Этот JavaScript front-end фреймворк создали в facebook, открыв исходный код в 2013 году.": "React.js",
  "Этот фреймворк, появившийся в 2010 году, основывается на Node.js.": "Express",
  "В Angular главный такой элемент контролирует всё веб-приложение, а второстепенные (дополнительные) такие элементы, которых много, занимаются узкими задачами, отвечая например за навигацию или анимацию. Как в Angular называются такие элементы?": "модуль",
  "Такие фреймворки используются для формирования удобного, с точки зрения современных тенденций и требований, пользовательского интерфейса:": "front-end",
  "Выберите из списка инструменты, средства или технологии, используемые для back-end разработки": ["C#", "PHP"],
  "Фреймворк Laravel написан на языке программирования:": "PHP",
  "Этот MVC фреймворк имеет возможность использовать его как fullstack, для чего имеется функционал для компилирования CSS и JavaScript приложения с помощью соответствующего компонента из его состава. Кроме того он может служить серверной частью API для одностраничного JavaScript или мобильного приложения.": "Laravel",
  "Фреймворк Express написан на языке программирования:": "JavaScript",
  "Этот front-end фреймворк позволяет использовать расширение синтаксиса JavaScript, названное JSX, при описании интерфейса.": "React.js",
  "Django имеет не MVC структуру, а такую:": "Model-View-Template",
  "Разработка внутри этого фреймворка ведется с использованием TypeScript.": "Angular",
  "B Django такой аналог LINQ позволяет взаимодействовать с БД:": "ORM Django",
  "В Django можно перейти к непосредственным SQL-запросам в целевую СУБД, не используя дополнительный API, записав SQL-запрос в соответствующий метод, который называется:": "RAW",
  "Когда в программе на Angular один компонент с одинаковой логикой используется в разных частях приложения эффективно использовать такую составную часть:": "директивы",
  "Это может быть использовано как набор подсистем близкой функциональности, не влияя на архитектуру основного программного продукта и не накладывая никаких ограничений. Что это (возможно он/она или оно)?": "библиотека",
  "Они отвечают за отдельные, но критически важные части веб-приложения, без которых оно не сможет нормально работать, но при этом правила и архитектура таких фреймворков не даёт возможности разработать веб-приложение с богатым интерфейсом.": "back-end",
  "Акроним СGІ означает:": "Common Gateway Interface"
}
